const lists =[
    {
        name: 'Як додавати CSS класи до компонентів',
        description: 'Зауважте, що цей функціонал не є частиною React, але надається сторонніми бібліотеками. React не має чіткої точки зору стосовно визначення стилів; якщо ви маєте сумнів, гарним початком може бути визначення ваших стилів в окремому *.css файлі з посиланням на них використовуючи className.',
        id:1,
    },
    {
        name: 'Як додавати CSS класи до компонентів',
        description: 'Зауважте, що цей функціонал не є частиною React, але надається сторонніми бібліотеками. React не має чіткої точки зору стосовно визначення стилів; якщо ви маєте сумнів, гарним початком може бути визначення ваших стилів в окремому *.css файлі з посиланням на них використовуючи className.',
        id:2,
    },
    {
        name: 'Як додавати CSS класи до компонентів',
        description: 'Зауважте, що цей функціонал не є частиною React, але надається сторонніми бібліотеками. React не має чіткої точки зору стосовно визначення стилів; якщо ви маєте сумнів, гарним початком може бути визначення ваших стилів в окремому *.css файлі з посиланням на них використовуючи className.',
        id:3,
    },
    {
        name: 'Як додавати CSS класи до компонентів',
        description: 'Зауважте, що цей функціонал не є частиною React, але надається сторонніми бібліотеками. React не має чіткої точки зору стосовно визначення стилів; якщо ви маєте сумнів, гарним початком може бути визначення ваших стилів в окремому *.css файлі з посиланням на них використовуючи className.',
        id:4,
    },
    {
        name: 'Як додавати CSS класи до компонентів',
        description: 'Зауважте, що цей функціонал не є частиною React, але надається сторонніми бібліотеками. React не має чіткої точки зору стосовно визначення стилів; якщо ви маєте сумнів, гарним початком може бути визначення ваших стилів в окремому *.css файлі з посиланням на них використовуючи className.',
        id:5,
    },
    {
        name: 'Як додавати CSS класи до компонентів',
        description: 'Зауважте, що цей функціонал не є частиною React, але надається сторонніми бібліотеками. React не має чіткої точки зору стосовно визначення стилів; якщо ви маєте сумнів, гарним початком може бути визначення ваших стилів в окремому *.css файлі з посиланням на них використовуючи className.',
        id:6,
    },
    {
        name: 'Як додавати CSS класи до компонентів',
        description: 'Зауважте, що цей функціонал не є частиною React, але надається сторонніми бібліотеками. React не має чіткої точки зору стосовно визначення стилів; якщо ви маєте сумнів, гарним початком може бути визначення ваших стилів в окремому *.css файлі з посиланням на них використовуючи className.',
        id:7,
    },
    {
        name: 'Як додавати CSS класи до компонентів',
        description: 'Зауважте, що цей функціонал не є частиною React, але надається сторонніми бібліотеками. React не має чіткої точки зору стосовно визначення стилів; якщо ви маєте сумнів, гарним початком може бути визначення ваших стилів в окремому *.css файлі з посиланням на них використовуючи className.',
        id:8,
    }
]
export function List() {
    return (
        <div className="row">
        {
            lists.map((list) => {
                return(
                    <div className="col-3" key={list.id}>
                        <p>{list.name}</p>
                        <p>{list.description}</p>
                        <button className="btn btn-primary">Замовити</button>
                    </div>
                )
            })
        }
        </div>
    );
}